# TextStyleUnderline Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextStyleUnderline Property
ParameterTypeId Class See Also
---
"Underline"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextStyleUnderline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextStyleUnderline As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextStyleUnderline {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace